app/controllers/garments_controller.rb

  def index
    @garments = Garment.all
---
SELECT "garments".* FROM "garments"

  def create
    #.new and .save will tell you if it created or not (vs. .create)
    #@garment.errors will tell you the errors of why it was not created
    @garment = Garment.new(garment_params)
    if @garment.save
---
INSERT INTO "garments" ("name", "image_url", "category", "season", "location", "status", "fabrication", "trim_button", "trim_label", "trim_zipper", "trim_hangtag", "sizing", "measurement", "fit_comment", "comment", "brand_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"