app/controllers/suppliers_controller.rb

  def find_supplier
    @supplier = Supplier.find(params[:id])
---
SELECT  "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]